#ifndef CONSTANTS_H
#define CONSTANTS_H

#ifdef __cplusplus
extern "C" {
#endif


/* JMDC names */
const char* _JMDC[]= {      "",       "",       "",       "",
                            "",       "",       "",       "",
                            "",       "",       "",       "",
                      "JMDC-0", "JMDC-1", "JMDC-2", "JMDC-3",
                            "",       "",       "",       "",
                            "",       "",       "",       ""
                    }; 

/* JINJ names */
const char* _JINJ[]= { "JINJ-0  ",   "JINJ-1",   "JINJ-2",   "JINJ-3",
                       "JINJ-P-A", "JINJ-P-B", "JINJ-S-A", "JINJ-S-B"};

/* JINF names */
const char* _JINF[]= {
                      "JINF-E0-A",  "JINF-E0-B", "JINF-E0-P", "JINF-E0-S", 
                      "JINF-E1-A",  "JINF-E1-B", "JINF-E1-P", "JINF-E1-S", 

                      "JINF-R0-A",  "JINF-R0-B", "JINF-R0-P", "JINF-R0-S",
	              "JINF-R1-A",  "JINF-R1-B", "JINF-R1-P", "JINF-R1-S",

                      "JINF-T0-A",  "JINF-T0-B", "JINF-T0-P", "JINF-T0-S",  
                      "JINF-T1-A",  "JINF-T1-B", "JINF-T1-P", "JINF-T1-S",  
                      "JINF-T2-A",  "JINF-T2-B", "JINF-T2-P", "JINF-T2-S",  
                      "JINF-T3-A",  "JINF-T3-B", "JINF-T3-P", "JINF-T3-S",  
                      "JINF-T4-A",  "JINF-T4-B", "JINF-T4-P", "JINF-T4-S",  
                      "JINF-T5-A",  "JINF-T5-B", "JINF-T5-P", "JINF-T5-S",  

#define NGRD 8

/* PMT DTSs */ 
#define NDTS 48
#define SIDES 2

int PMTS[2][12];

int PMTB[2][12];

char DATA[4][15];

char RICH_CALIB_TABLE[5][30];

char GAIN[2][10];

/* RDR TYPE FOR FE LV MONITOR */
int RDR_TYPE[24];
int RDR_FE_LV[2][24];

/* CONVERSION FACTORS */
#define K_DCDC 0.975
#define Q_DCDC 3.
#define K_LR   0.950
#define Q_LR   3.

/* JLV1 */
#define TJLV1toSeconds 640e-9 // 640ns/unit

/* TDV params */
#define MAXTDV 1000
#define NSPAN 4 
#define HRDLTDVSample 10000

#define RAW 1
#define COMPRESSED 2
#define MIXED 3

#define RAWBLKSIZE 993
#define CTABLESIZE 2480

#define TRUE 1
#define FALSE 0

typedef unsigned short u16;
typedef unsigned int u32;
typedef unsigned long long u64;

int DEBUG;

int decode_block(u32 type, u16 *event, u32 size, u32 length);
int decode_AMSblock(u16 *event, u32 size, u32 length);
int decode_calib_block(u16 *event, u32 size, u32 length);
int decode_jmdc(u32 header_type, char rr, char rw, u16 node, u32 type, u16 *event, u32 size, u32 length);
int decode_sddg(char rr, char rw, u16 node, u16 *event, u32 size, u32 length);
int decode_calib(u32 header_type, char rr, char rw, u16 node, u16 *event, u32 size, u32 length);
int decode_config(u32 header_type, char rr, char rw, u16 node, u16 *event, u32 size, u32 length);
int decode_hkinfo(u32 header_type, char rr, char rw, u16 node, u16 *event, u32 size, u32 length);
int decode_hkcnf(char rr, char rw, u16 node, u32 type, u16 *event, u32 size, u32 length);
int decode_trd_block(u16 node, u16 *event, u32 length);
int decode_jlv1_block(u16 node, u16 *event, u32 length);
int decode_rich_block(u16 jnode, u16 node, u16 *event, u32 length);
int decode_rich_calib(u16 node, u16 *event, u32 length);
int decode_jinr_config(u16 jnode, u16 node, u16 *event, u32 length);
int decode_rdr_config(u16 jnode, u16 knode, u16 node, u16 *event, u32 length);
int decode_jinr_hkinfo(u16 jnode, u16 node, u16 *event, u32 length);
int decode_rdr_hkinfo(u16 jnode, u16 knode, u16 node, u16 *event, u32 length);
int decode_dts_short(char rr, char rw, u16 node, u16 *event, u32 size, u32 length);
int decode_dts_long(char rr, char rw, u16 node, u16 *event, u32 size, u32 length);
int PrintError(u16 status);
int dump_block(u16 *event, u32 length);
int decode_RXstatus(u16 RXstatus);
int decode_RXaddress(u16 RXaddress);
int decode_status(u16 status);
void fill_reply(char *cReply, u16 ReplyCode, u16 DAT);
int fill_status(char *cStatus, u16 SlaveStatus);
int fill_reply_from_statusword(char *cReply, u16 stat);
int fill_status_from_statusword(char *cStatus, u16 stat);
int is_amsw(u16 NodeAddress);
int is_can(u16 NodeAddress);
int is_jmdc(u16 NodeAddress);
int is_tas();

void PrepareFCSTable();
unsigned short DoFCS(unsigned short *data, int size);

// Huffman decoding arrays
u16 huffman_swap;
u16 huffman_first_code[16];
u16 huffman_decode_table[16][256];
u16 huffman_restore[0x8000];

u16 huffman_bit(u16 *data, u32 i);
u16 huffman_decode(u16 *istream, u16 length, u16 **dest);
void huffman_decode_init(void);

// Event Blocks
struct PrimaryHeaderBlock{
  u32 Length;
  u32 Size;
  char RR;
  char RW;
  u16 Node;
  u32 Type;
}; typedef struct PrimaryHeaderBlock PrimaryHeaderBlock;

struct SecondaryHeaderBlock{
  u16 Status;
  u16 Tag;
  u32 Time;
}; typedef struct SecondaryHeaderBlock SecondaryHeaderBlock;

struct JMDCblock{
  u32 Length;
  u32 Size;
  char RR;
  char RW;
  u16 Node;
  u32 Type;
  u16 RunTag;
  u32 RunID;
  u16 Time;
  u32 EventNo;
  u16 CmdNb;
  u16 NbCmds;
  u16 LV3[4];
  u16 GPS[5];
}; typedef struct JMDCblock JMDCblock;


struct JLV1block{
  u16 FT_pattern;
  u16 LV1_pattern;
  u16 ACC_pattern;
  u16 TOF_pattern;
  u64 Time;
  float LiveTime[2];
  u16 FTscaler;
  u16 LV1scaler;
  u16 SubLV1scaler[8];
}; typedef struct JLV1block JLV1block;

struct AMSblock{
  u16 Event;
  u32 Time;
}; typedef struct AMSblock AMSblock;

AMSblock AMSblockLast;
int AMSblockInit(AMSblock *);

struct BlockStat{
   u32 Length;
   u16 Status;
   u16 rx_sta;
   u16 rx_len;
   u16 event;
   char cstat[100];
   char estat[100];
   char xstat[100];
}; typedef struct BlockStat BlockStat;

struct RICHblock{
  u16 RichHitsGx1; 
  u16 RichHitsGx5; 
}; typedef struct RICHblock RICHblock;

struct Event{
  u32 JINJSlaves;
  u16 DataBlocks;
  u16 JMDCBlocks;
  PrimaryHeaderBlock PrimaryHeader;
  SecondaryHeaderBlock SecondaryHeader;
  JMDCblock JMDC;
  JLV1block JLV1;
  float JLV1DeltaTime;
  float JMDCDeltaTime;
  BlockStat JINJ[NJINJ];
  BlockStat JINF[NJINJ][NJINJSlaves];
  BlockStat RDR[2][12];
  char cstat[1000];
  RICHblock RICH;
}; typedef struct Event Event;

Event EventFirst, EventLast, EventPrev;

void EventInit(Event *);
int EventStat(Event *);
void EventPrint(Event *);
int EventWrite(Event *);
int EventCheck(int event_jok);
int WriteError(int, Event *);

// DTS block
#define MAXDTS 64
#define NNOD 2
enum { k0x28 = 0, k0x29 = 1};
#define NBUS 4
enum { kBus3 = 0, kBus4 = 1, kBus5 = 2, kBus6 = 3 };

struct DTS {
  u16 Node;
  u32 Time;
  u16 Bus;
  u16 Ndts;
  u16 Ok[MAXDTS];
  float Temp[MAXDTS];
  u32 Age[MAXDTS];
}; typedef struct DTS DTS;

int DTSPrint(DTS *);
int DTSWrite(DTS *);

struct DallasTempSensor{
  PrimaryHeaderBlock PrimaryHeader;
  SecondaryHeaderBlock SecondaryHeader;
  DTS Dallas;
}; typedef struct DallasTempSensor DallasTempSensor;

DallasTempSensor DTSinfo[NNOD][NBUS];

// Run counters
struct ShortEvent{
  u32 RunTag;
  u32 RunID;
  u32 EventNo;
  u32 Time;
  u32 msec;
}; typedef struct ShortEvent ShortEvent;

struct Run{
  u32 ReadEvents;
  u32 JINJSlaves;
  u16 FT_pattern;
  u16 LV1_pattern;
  u16 ACC_pattern;
  u16 TOF_pattern;
  double TDiffSum;
  u32 TDiffMin;
  u32 TDiffMax;
  double TJLV1DiffSum;
  u32 TJLV1DiffMin;
  u32 TJLV1DiffMax;
  ShortEvent FirstEvent;
  ShortEvent LastEvent;
  double AveEventSize;
  double MaxEventSize;
  double AveRichHitsGx5;
  u16 MaxRichHitsGx5;
  double AveRichHitsGx1;
  u16 MaxRichHitsGx1;
  u32 ReadLiveTimes;
  double AveLiveTime[2];
  double MinLiveTime[2];
  u32 ReadScalers;
  double AveFTscaler;
  double AveLV1scaler;
  double AveSubLV1scaler[8];
}; typedef struct Run Run;

Run RunFirst, RunLast;

int RunClear();
int RunReport();

// General Counters & Flags
int events_read;
int events_good;
int events_nerr;
int events_njerr;
int events_neerr;
int events_nrerr;
int events_nserr;
int events_nterr;
int events_nuerr;
int events_cerr;
int StatusErrorCounter[2][16];
int crc_error;
int event_jok;
int event_eok;
int event_rok;
int event_sok;
int event_tok;
int event_uok;

int is_Physics;

int FakeFS;

int utype_events;
int calib_events;
int daqhk_events;
int config_events;
int sci_events;
int sci_calib_events;
int sci_daqhk_events;
int sci_config_events;

char rdr_proc_mode[2];
int rdr_calib_blocks;
int rdr_config_blocks;
int rdr_daqhk_blocks;
int jinr_config_blocks;
int jinr_daqhk_blocks;
int jinr_sci_blocks;
double jinr_sci_length;

int rich_hits_Gx5;
int rich_hits_Gx1;
int rich_hits_bad;

int FT_ExtGate0;
int FT_ExtGate1;
int FT_ExtGate0x1;

int FT_pattern_cnt[16];

int ErrorClear();
int ErrorReport();

/* Ouput Handling */
FILE *pout, *perr, *pcnt;

char LogsDir[200];

char FileOutName[200], FileErrName[200], FileCntName[200];

char BlockFilePath[200], BlockFileName[200];
char BlockFileServerDir[200],BlockFileServerPath[200];
char BlockFileParentPath[200], BlockFileGrandParentPath[200];

char fdate[40];
char BlockFileDate[40], EventFirstDate[40], EventDate[40];

FILE *pjconf, *pjdaqhk, *prcalib, *prconf, *prdaqhk;
FILE *pmon;
FILE *ptagcalib, *ptagdata, *ptagrdaqhk, *ptagrconf, *ptagjdaqhk, *ptagjconf;
FILE *pfile;

char FileLogJINRConfigName[100], FileLogJINRHKinfoName[100];
char FileLogRDRConfigName[100], FileLogRDRHKinfoName[100], FileLogRDRCalibName[100];
char FileLogDTSmonName[100];

char FileMonRDRHKinfoName[100];

char FileTagRDRData[100], FileTagRDRCalib[100];
char FileTagRDRConf[100], FileTagRDRHK[100];
char FileTagJINRConf[100], FileTagJINRHK[100];
char FileTagDTSData[100];

char FileMsg[100], FileNok[100];

char FileMsgRDRData[100], FileMsgRDRCalib[100];
char FileMsgRDRConf[100], FileMsgRDRHK[100];
char FileMsgJINRConf[100], FileMsgJINRHK[100];
char FileMsgDTSData[100];
char FileMsgRMON[100];

char FileNCRDRData[100], FileNCRDRCalib[100];
char FileNCRDRConf[100], FileNCRDRHK[100];
char FileNCJINRConf[100], FileNCJINRHK[100];
char FileNCDTSData[100];
char FileNCRMON[100];

char FileOKRDRData[100], FileOKRDRCalib[100];
char FileOKRDRConf[100], FileOKRDRHK[100];
char FileOKJINRConf[100], FileOKJINRHK[100];
char FileOKDTSData[100];
char FileOKRMON[100];

char FileKORDRData[100], FileKORDRCalib[100];
char FileKORDRConf[100], FileKORDRHK[100];
char FileKOJINRConf[100], FileKOJINRHK[100];
char FileKODTSData[100];
char FileKORMON[100];

char FileTagNC[100], FileLogNC[100];
char FileTagOK[100], FileLogOK[100];
char FileTagKO[100], FileLogKO[100];

char FileSubELOG[100];
char FileTxtELOG[100];
char FileTxtPOPW[100];

char cmdELOG[100], cmdPOPW[100];

#define MAXLP 400
char lout[MAXLP][500];


/********** Configuration/HouseKeeping **********/

// RDR Calibration 
struct RDRCalTables{
  u16 PedGx1[NCHN_RDR];
  u16 PedGx5[NCHN_RDR];
  u16 Thrsld[NCHN_RDR];
  u16 SigGx5[NCHN_RDR];
  u16 Status[NCHN_RDR];
}; typedef struct RDRCalTables RDRCalTables;

struct RDRCalibration{
  u16 CalibStatus;
  RDRCalTables Tables;
  u16 Status;
}; typedef struct RDRCalibration RDRCalibration;


// Configuration Blocks
struct cpar{
  u16 Parameter;
  u16 Readback;
}; typedef struct cpar cpar;

struct RDRVerBlock{
  u16 pro_vers;
  u16 sub_vers;
}; typedef struct RDRVerBlock RDRVerBlock;

struct RDRSeqBlock{
  cpar peak_time[4];   /* 0001 - 0004 */
  cpar fepow_ctrl;     /* 0005 */
  cpar busy_ctrl;      /* 0006 */
  cpar ft_ctrl;        /* 0007 */
  cpar lv1_ctrl;       /* 0008 */
}; typedef struct RDRSeqBlock RDRSeqBlock;

struct RDRProBlock{
  cpar sig_prev;                 /* 1000 */
  cpar sig_cut;                  /* 1001 */
  cpar low_cut;                  /* 1002 */
  cpar sat;                      /* 1003 */
  cpar rich_mode;                /* 1004 */
  cpar max_len_hgh_thr;          /* 1005 */
  cpar max_len_low_thr;          /* 1006 */
  cpar low_thr_evt_len;          /* 1007 */
  cpar low_thr_evt_len_min_evts; /* 1008 */
  cpar hgh_thr_evt_len;          /* 1009 */
  cpar hgh_thr_evt_len_max_evts; /* 100A */
  cpar max_evts;                 /* 100B */
  cpar hgh_thr_mean_len;         /* 100C */
  cpar low_thr_mean_len;         /* 100D */
  cpar lv_type;                  /* 100E */
  cpar max_lv;                   /* 100F */
  cpar min_lv;                   /* 1010 */
  cpar max_chn_masked_user;      /* 1011 */
  cpar max_chn_masked;           /* 1012 */
  cpar max_chn_masked_itera;     /* 1013 */
  cpar max_chn_masked_over;      /* 1014 */
  cpar max_nb_hits_pmt;          /* 1015 */
  cpar hgh_ampl_threshold;       /* 1016 */
  cpar bad_hit_thrs;             /* 1017 */
  cpar max_nb_bad_pmts;          /* 1018 */
  cpar max_nb_bad_hits;          /* 1019 */
  cpar cal_dis_mask;             /* 101A */
  cpar lv_read_ctrl;             /* 101B */
  cpar auto_power_off;           /* 101C */
}; typedef struct RDRProBlock RDRProBlock;

struct RDRUsrBlock{
  cpar mask[31];
}; typedef struct RDRUsrBlock RDRUsrBlock;

struct RDRCalBlock{
  cpar mask[31];
}; typedef struct RDRCalBlock RDRCalBlock;

struct RDRMisBlock{
  u16 mismatches;
}; typedef struct RDRMisBlock RDRMisBlock;

struct RDRConfiguration{
  PrimaryHeaderBlock PrimaryHeader;
  SecondaryHeaderBlock SecondaryHeader;
  u16 Event; /* what is this? */
  u32 Time;
  RDRVerBlock RDRVer;
  RDRSeqBlock RDRSeq;
  RDRProBlock RDRPro;
  RDRUsrBlock RDRUsr;
  RDRCalBlock RDRCal;
  RDRMisBlock RDRMis;
  u16 Status;
  u16 CRC16;
}; typedef struct RDRConfiguration RDRConfiguration;


struct JINRhvBlock{
  u16 Value[42][2];
  u16 Status[2];
  u16 Error[12];
  u16 ErrorCode[2];
  u16 Reserved[4];
}; typedef struct JINRhvBlock JINRhvBlock;

struct JINRx2Block{
  u16 SlaveMask[32][2];
  u16 SlaveMaskErrorCode[2];
  u16 Register[4][2];
  u16 RegisterErrorCode[2];
  u16 Reserved[4];
